Tekla.Structures.DrawingInternal.RectangularGeometryHelper
Provides helper methods for calculating rectangular geometry properties.

Tekla.Structures.DrawingInternal.RectangularGeometryHelper.CalculateEndPoint(Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double)
Calculates the end point of a rectangle given its start point, dimensions, and rotation angle.
startPoint: The starting point of the rectangle.
width: The width of the rectangle.
height: The height of the rectangle.
angle: The rotation angle in degrees.
Returns: The calculated end point of the rectangle.

Tekla.Structures.DrawingInternal.RectangularGeometryHelper.CalculateWidthAndHeight(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Calculates the width and height of a rectangle given its start point, end point, and rotation angle.
startPoint: The starting point of the rectangle.
endPoint: The ending point of the rectangle.
angle: The rotation angle in degrees.
Returns: A tuple containing the calculated width and height as absolute values.

Tekla.Structures.DrawingInternal.RectangularGeometryHelper.MinimizePoints(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Determines the minimum and maximum points from two given points.
This method assumes the angle is zero (no rotation).
startPoint: The first point.
endPoint: The second point.
Returns: A tuple containing the minimum point (lower-left corner) and maximum point (upper-right corner).